status/2021/02apr21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>27 March 2021 - 02 April 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">27 March 2021 - 02 April 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaef9109">1. Santa Cruz Weather Station</a></li>
<li><a href="#org8974c35">2. EPICS</a></li>
<li><a href="#org83ac079">3. Brini Tracker II</a></li>
<li><a href="#orgd43d25d">4. wktcolor</a></li>
<li><a href="#orgef6b967">5. grass/dcw</a></li>
<li><a href="#org5202752">6. ca-r</a></li>
</ul>
</div>
</div>
<p>
Spring hot and cold with impending drought.
</p>

<div id="outline-container-orgaef9109" class="outline-2">
<h2 id="orgaef9109"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Mast sensors still broken
</p>
</div>
</div>
<div id="outline-container-org8974c35" class="outline-2">
<h2 id="org8974c35"><span class="section-number-2">2.</span> EPICS</h2>
<div class="outline-text-2" id="text-2">
<p>
no progress
</p>
</div>
</div>
<div id="outline-container-org83ac079" class="outline-2">
<h2 id="org83ac079"><span class="section-number-2">3.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-3">
<p>
Buttons still work after eleven weeks week of runtime. GPS display update
seems to be intermittent but is working at this moment.
</p>
</div>
</div>

<div id="outline-container-orgd43d25d" class="outline-2">
<h2 id="orgd43d25d"><span class="section-number-2">4.</span> wktcolor</h2>
<div class="outline-text-2" id="text-4">
<p>
Various C++ distractions. "Well Known Text" format may be well known,
and it <b>is</b> well documented, but doesn't seem to always be well or
consistently implemented. Seems that neither boost nor CGAL can read
the files produced by GEOS. Plus they can produce some entities that
GEOS can't read.
</p>

<p>
Explored flex/bison and ANTLR C++ bindings, which reminds me how
poorly generated code interacts with style checkers.
</p>

<p>
Now, instead of boost, may use GEOS for WKT, OpenMesh for geometry
analysis (because it implements a comprehensible "half-edge" data
structure) and igraph for graph analysis, which is needed for the
coloring algorithm. Or do it in Go, Ruby, or Julia. Not
python. Please, not python. Don't make me do it in python.
</p>
</div>
</div>

<div id="outline-container-orgef6b967" class="outline-2">
<h2 id="orgef6b967"><span class="section-number-2">5.</span> grass/dcw</h2>
<div class="outline-text-2" id="text-5">
<p>
After I don't know after how many years - maybe decades - I finally
imported DCW (Digital Chart of the World) geographic data into GRASS.
</p>
</div>
</div>

<div id="outline-container-org5202752" class="outline-2">
<h2 id="org5202752"><span class="section-number-2">6.</span> ca-r</h2>
<div class="outline-text-2" id="text-6">
<p>
wget -O out/covid19cases<sub>test.csv</sub> <a href="https://data.chhs.ca.gov/dataset/f333528b-4d38-4814-bebb-12db1f10f535/resource/046cdd2b-31e5-4d34-9ed3-b48cdbc4be7a/download/covid19cases_test.csv">https://data.chhs.ca.gov/dataset/f333528b-4d38-4814-bebb-12db1f10f535/resource/046cdd2b-31e5-4d34-9ed3-b48cdbc4be7a/download/covid19cases_test.csv</a>
</p>

<p>
&#x2013;2021-04-03 06:30:05&#x2013;  <a href="https://data.chhs.ca.gov/dataset/f333528b-4d38-4814-bebb-12db1f10f535/resource/046cdd2b-31e5-4d34-9ed3-b48cdbc4be7a/download/covid19cases_test.csv">https://data.chhs.ca.gov/dataset/f333528b-4d38-4814-bebb-12db1f10f535/resource/046cdd2b-31e5-4d34-9ed3-b48cdbc4be7a/download/covid19cases_test.csv</a>
</p>

<p>
Resolving data.chhs.ca.gov (data.chhs.ca.gov)&#x2026; 104.19.218.112, 104.19.219.112, 2606:4700::6813:da70, &#x2026;
</p>

<p>
Connecting to data.chhs.ca.gov (data.chhs.ca.gov)|104.19.218.112|:443&#x2026; connected.
</p>

<p>
HTTP request sent, awaiting response&#x2026; 500 Internal Server Error
</p>

<p>
2021-04-03 06:30:10 ERROR 500: Internal Server Error.
</p>

<p>
make: <b>*</b> [Makefile:19: out/covid19cases<sub>test.csv</sub>] Error 8
</p>

<p>
Grr.
</p>

<p>
Covid-19 case data broken again - this time with no obvious replacement.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
